function 字符串切割(數據,切割字符)
	數據 = 數據 .. 切割字符
	local t = {}
	local 目前位置 = 1
	repeat
			local nexti = string.find(數據, 切割字符, 目前位置)
			table.insert(t, string.sub(數據, 目前位置,nexti-string.len(切割字符)))
			目前位置 = nexti + string.len(切割字符)
	until 目前位置 > string.len(數據)
	return t
end
臨時NPC索引 = {};
--[[=========商城變量===========]]
商城數據 = {};
商城數據.最新上架={};
商城數據.促銷商品={};
商城數據.消耗商品={};
商城數據.道具商品={};
商城數據.寵物商品={};

商城道具類型 = {{"爪",1},{"斧頭",1},{"棍",1},{"槍",1},{"弓",1},{"盾",1},{"兜",1},{"凱",1},{"手環",1},{"樂器",1}
,{"首飾",1},{"首飾",1},{"帶子",1},{"耳環",1},{"鼻環",1},{"護身符",1},{"特殊",0},{"迴鏇標",1},{"投擲斧",1},{"投擲石",1}
,{"未知",0},{"未知",0},{"未知",0},{"未知",0},{"腰帶",1},{"盾",1},{"靴子",1},{"手套",1},{"使者信物",0},{"勇者信物",0},
{"未知",0},{"未知",0},{"未知",0},{"未知",0},{"未知",0},{"未知",0},{"未知",0},{"未知",0}}

道具屬性鏈接 = {{"攻擊力",%道具_附攻%,1},
								{"防禦力",%道具_附防%,1},
								{"敏捷力",%道具_附敏%,1},
								{"耐久力",%道具_附體%,1},
								{"氣力",%道具_附氣%,1},
								{"運氣",%道具_附運%,1},
								{"魅力",%道具_附魅%,1},
								{"閃避",%道具_附避%,1},
								{"格擋",%道具_格檔率%,1},
								{"攻序",%道具_攻序%,1},
								{"負重",%道具_負重%,1},
								{"命中",%道具_命中%,1},
								{"抗毒",%道具_毒耐%,1},
								{"抗麻",%道具_麻耐%,1},
								{"抗睡",%道具_睡耐%,1},
								{"抗石",%道具_石耐%,1},
								{"抗酒",%道具_酒耐%,1},
								{"抗混",%道具_混耐%,1},
								{"會心一擊",%道具_附一擊%,1}
								}--說明，常量，被除數（考慮到有些值需要除於100設置）
--[[=========================================================================]]

function 商城NPC創建迴調(NPC索引)
	人物.注冊對話框迴調("", "商城對話框迴調", NPC索引)
	return true;
end

function 創建商城NPC()
	讀取商城數據();
	local 商品內容={};
	商品內容[1] = 商城數據解析(商城數據.最新上架,"道具");
	商品內容[2] = 商城數據解析(商城數據.促銷商品,"道具");
	商品內容[3] = 商城數據解析(商城數據.消耗商品,"道具");
	商品內容[4] = 商城數據解析(商城數據.道具商品,"道具");
	商品內容[5] = 商城數據解析(商城數據.寵物商品,"寵物");
	係統.寫商城數據(0,商品內容[1]);
	係統.寫商城數據(1,商品內容[2]);
	係統.寫商城數據(2,商品內容[3]);
	係統.寫商城數據(3,商品內容[4]);
	係統.寫商城數據(4,商品內容[5]);
	商品內容=nil;
	臨時NPC索引.商城=係統.創建NPC("","商城NPC創建迴調")
end

function 商城寫入日誌(玩傢索引,購物車數據,扣除點數,臨時商城數據,玩傢沒扣除前點數)
	local 重新計算價格=0;
	local 寫入日誌內容;
	local 商城道具名="";
	for i=1,table.getn(購物車數據) do
		商城道具名 = 商城道具名 .. 道具.取模闆數據(購物車數據[i][1],%道具_原名%).."*"..購物車數據[i][2].."("..臨時商城數據[購物車數據[i][3]][2]*購物車數據[i][2]..")|";
		重新計算價格=重新計算價格+臨時商城數據[購物車數據[i][3]][2]*購物車數據[i][2];
	end
	if 重新計算價格 > 扣除點數 then
		商城道具名 = 商城道具名.."#扣除價格産生異常"
	end
	寫入日誌內容 = string.format("玩傢名：%s   計算商品的價格：%d   實際扣除點數：%d   沒扣除金幣前：%d   扣除後：%d\n購買商品：%s\n\n",Char.GetData(玩傢索引,%對像_原名%),
								重新計算價格,扣除點數,玩傢沒扣除前點數,人物.取數據(玩傢索引,%對像_VIP%),商城道具名);

	文件號=assert(io.open("./data/lua/onlineshop/shoplog.txt", "a+"))
	文件號:write(寫入日誌內容); -- 讀取所有內容
	文件號:close();
end

function 商城對話框迴調( NPC索引, 玩傢索引, 序號, 按鈕, 數據)
--[[
	當按鈕不為0的時候，玩傢選擇的是其它頁數
	當為0的時候,數據中的內容分解
	道具索引,數量#道具索引,數量#
]]
	if 按鈕 == 0 then
		local 商城ID = 轉整數(數據)
		if 商城ID == 1 then
			封包.發送對話框(玩傢索引,1001,1,1,人物.取道具空數量(玩傢索引).."|"..人物.取數據(玩傢索引,%對像_VIP%).."|1",NPC索引)
		elseif 商城ID == 2 then
			封包.發送對話框(玩傢索引,1001,2,2,人物.取道具空數量(玩傢索引).."|"..人物.取數據(玩傢索引,%對像_VIP%).."|2",NPC索引)
		elseif 商城ID == 3 then
			封包.發送對話框(玩傢索引,1001,3,3,人物.取道具空數量(玩傢索引).."|"..人物.取數據(玩傢索引,%對像_VIP%).."|3",NPC索引)
		elseif 商城ID == 4 then
			封包.發送對話框(玩傢索引,1001,4,4,人物.取道具空數量(玩傢索引).."|"..人物.取數據(玩傢索引,%對像_VIP%).."|4",NPC索引)
		elseif 商城ID == 5 then
			封包.發送對話框(玩傢索引,1001,5,5,人物.取道具空數量(玩傢索引).."|"..人物.取數據(玩傢索引,%對像_VIP%).."|5",NPC索引)
		end
	elseif 數據 ~= "" then
		local 購物車數據 = 字符串切割(數據,"#");
		local 物品總數 = 0;
		local 物品總價 = 0;
		local 物品ID = {};
		local 臨時商城數據;
		if 按鈕 == 1 then
			臨時商城數據 = 商城數據.最新上架;
		elseif 按鈕 == 2 then
			臨時商城數據 = 商城數據.促銷商品;
		elseif 按鈕 == 3 then
			臨時商城數據 = 商城數據.消耗商品;
		elseif 按鈕 == 4 then
			臨時商城數據 = 商城數據.道具商品;
		elseif 按鈕 == 5 then
			臨時商城數據 = 商城數據.寵物商品;
		end
		for i=1,table.getn(購物車數據) do
			if 購物車數據[i] ~="" then
				local 購物車數據再分 = 字符串切割(購物車數據[i],"|");
				物品ID[i]={};
				物品ID[i][1] = 臨時商城數據[轉整數(購物車數據再分[1])][1];
				物品ID[i][2] = 轉整數(購物車數據再分[2]);
				物品ID[i][3] = 轉整數(購物車數據再分[1]);
				物品總價 = 物品總價 + 臨時商城數據[物品ID[i][3]][2]*物品ID[i][2];
				物品總數 = 物品總數 + 物品ID[i][2];
			end
		end
		local 玩傢彩幣 = 人物.取數據(玩傢索引,%對像_VIP%);
		if 玩傢彩幣 < 物品總價 then
			封包.說話(玩傢索引,"係統：身上的金幣不足。",%紅色%);
			return;
		end
		if 人物.取道具空數量(玩傢索引) < 物品總數 then
			封包.說話(玩傢索引,"係統：身上的道具位不足。",%紅色%);
			return;
		end
		人物.置數據(玩傢索引,%對像_VIP%,玩傢彩幣-物品總價);
		for i=1,table.getn(物品ID) do
			封包.給道具(玩傢索引,物品ID[i][1],物品ID[i][2]);
		end

		商城寫入日誌(玩傢索引,物品ID,物品總價,臨時商城數據,玩傢彩幣);
		封包.說話(玩傢索引,"係統：扣除"..物品總價.."金幣！",%紅色%);
	end
end


function 商城數據解析(道具ID數據組,類型)
	local 返迴數據 = "";
		if table.getn(道具ID數據組) < 1 then
			return "";
		end
		for 道具索引=1,table.getn(道具ID數據組) do
			local 道具ID = 道具ID數據組[道具索引][1];
			local 道具類型 = 道具.取模闆數據(道具ID,%道具_類型%);
			local 道具圖號 = 道具.取模闆數據(道具ID,%道具_圖號%);

			返迴數據 = string.format("%s%s|%d|%d|%d|道具類型：%s\n",返迴數據,道具.取模闆數據(道具ID,%道具_原名%),道具圖號,道具圖號,道具ID數據組[道具索引][2],商城道具類型[道具類型+1][1]);
			if 商城道具類型[道具類型+1][2]== 1 then
				if 道具.取模闆數據(道具ID,%道具_MAX耐久%) == 0 then
					返迴數據 = 返迴數據.."耐久度：不會損壞\n\n"
				else
					返迴數據 = string.format("%s耐久度：%d/%d\n\n",返迴數據,math.ceil(道具.取模闆數據(道具ID,%道具_耐久%)/100),math.ceil(道具.取模闆數據(道具ID,%道具_MAX耐久%)/100));
				end
				for 道具屬性索引 = 1,table.getn(道具屬性鏈接) do --//遍曆常用屬性的值
					local 道具值 = 道具.取模闆數據(道具ID,道具屬性鏈接[道具屬性索引][2]);
					if 道具值 ~= 0 then
						返迴數據 = string.format("%s%s %s\n",返迴數據,道具屬性鏈接[道具屬性索引][1],道具屬性符號(道具值));
					end
				end
				if 道具.取模闆數據(道具ID,%道具_精靈%) >= 0 then
					返迴數據 = string.format("%s\n精靈 %s",返迴數據,技能.取精靈技能數據(道具.取模闆數據(道具ID,%道具_精靈%),%精靈_名%));
				end
				返迴數據 = 返迴數據.."#";
			else
				返迴數據 = 返迴數據..道具.取模闆數據(道具ID,%道具_說明%).."#";
			end
		end
	return 返迴數據;
end

function 道具屬性符號(道具屬性)--//增加道具值正負符號
	if 道具屬性 > 0 then
		return "+"..道具屬性;
	else
		return 道具屬性;
	end
end

function 職業需求(道具ID)--返迴道具要求職業
	local 道具職業 = 道具.取模闆數據(道具ID,%道具_職業%);
	if 道具職業 == 0	then
		return "(通用)"
	elseif 道具職業 == 1 then
		return "(白狼勇士)"
	elseif 道具職業 == 2 then
		return "(暗靈法師)"
	elseif 道具職業 == 3 then
		return "(追獵者)"
	end
end

function ITRF_NEWSHOP(玩傢索引)--相本迴調 改為 新商城
--[[
商城數據說明
人物道具空數量|彩幣|頁數|數據
]]
	if 人物.取數據(玩傢索引,%對像_戰模%) == 0 and 人物.取數據(玩傢索引,%對像_擺攤%) <= 0 then
		封包.發送對話框(玩傢索引,1001,1,1,人物.取道具空數量(玩傢索引).."|"..人物.取數據(玩傢索引,%對像_VIP%).."|1",臨時NPC索引.商城)
	end
end


function 讀取商城數據()
	local 文件號;
	local 數據,數量,臨時商城數據;
	for i =1,5 do
		if i == 1 then
			臨時商城數據 = 商城數據.最新上架;
		elseif i == 2 then
			臨時商城數據 = 商城數據.促銷商品;
		elseif i == 3 then
			臨時商城數據 = 商城數據.消耗商品;
		elseif i == 4 then
			臨時商城數據 = 商城數據.道具商品;
		elseif i == 5 then
			臨時商城數據 = 商城數據.寵物商品;
		end
		文件號 = assert(io.open("./data/lua/onlineshop/shop"..i..".txt", "r"))
		數據 = 文件號:read("*a"); -- 讀取所有內容
		文件號:close();
		if 數據 ~= "" then
			數量 = 0;
			數據 = 字符串切割(數據,"\n");
			for b = 1,table.getn(數據) do
				if string.sub(數據[b],1,1) ~= "#" and string.sub(數據[b],1,1) ~= "" then
					數量 = 數量 + 1;
					臨時商城數據[數量] = 字符串切割(數據[b],"|");
					臨時商城數據[數量][1] = tonumber(臨時商城數據[數量][1]);
					臨時商城數據[數量][2] = tonumber(臨時商城數據[數量][2]);
				end
			end
		end
	end
end

創建商城NPC();

